results/run-100vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m03.0s), 100/100 VUs, 22 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m04.0s), 100/100 VUs, 120 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m05.0s), 100/100 VUs, 213 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m06.0s), 100/100 VUs, 292 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m07.0s), 100/100 VUs, 330 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m08.0s), 100/100 VUs, 421 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m09.0s), 100/100 VUs, 519 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m10.0s), 100/100 VUs, 613 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m11.0s), 100/100 VUs, 680 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m12.0s), 100/100 VUs, 723 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m13.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m14.0s), 100/100 VUs, 906 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m15.0s), 100/100 VUs, 985 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m16.0s), 100/100 VUs, 1035 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m17.0s), 100/100 VUs, 1121 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m18.0s), 100/100 VUs, 1218 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m19.0s), 100/100 VUs, 1306 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m20.0s), 100/100 VUs, 1383 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m21.0s), 100/100 VUs, 1430 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m22.0s), 100/100 VUs, 1520 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m23.0s), 100/100 VUs, 1611 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m24.0s), 100/100 VUs, 1691 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m25.0s), 100/100 VUs, 1757 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m26.0s), 100/100 VUs, 1823 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m27.0s), 100/100 VUs, 1918 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m28.0s), 100/100 VUs, 2006 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m29.0s), 100/100 VUs, 2083 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m30.0s), 100/100 VUs, 2133 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m31.0s), 100/100 VUs, 2220 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m32.0s), 100/100 VUs, 2314 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m33.0s), 100/100 VUs, 2399 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m34.0s), 100/100 VUs, 2465 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m35.0s), 100/100 VUs, 2526 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m36.0s), 100/100 VUs, 2619 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m37.0s), 100/100 VUs, 2708 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m38.0s), 100/100 VUs, 2785 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m39.0s), 100/100 VUs, 2845 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m40.0s), 100/100 VUs, 2920 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m41.0s), 100/100 VUs, 3017 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m42.0s), 100/100 VUs, 3104 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m43.0s), 100/100 VUs, 3171 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m44.0s), 100/100 VUs, 3231 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m45.0s), 100/100 VUs, 3320 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m46.0s), 100/100 VUs, 3409 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m47.0s), 100/100 VUs, 3490 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m48.0s), 100/100 VUs, 3557 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m49.0s), 100/100 VUs, 3624 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m50.0s), 100/100 VUs, 3718 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m51.0s), 100/100 VUs, 3802 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m52.0s), 100/100 VUs, 3874 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m53.0s), 100/100 VUs, 3943 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m54.0s), 100/100 VUs, 4020 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m55.0s), 100/100 VUs, 4110 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m56.0s), 100/100 VUs, 4196 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m57.0s), 100/100 VUs, 4262 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m58.0s), 100/100 VUs, 4326 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m59.0s), 100/100 VUs, 4419 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m59.0s/1m0s

running (1m00.0s), 100/100 VUs, 4504 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  1m00.0s/1m0s

running (1m01.0s), 027/100 VUs, 4580 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  1m0s


  █ TOTAL RESULTS 

    checks_total.......: 4607    75.193247/s
    checks_succeeded...: 100.00% 4607 out of 4607
    checks_failed......: 0.00%   0 out of 4607

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=139.61ms min=53.05ms med=215.08ms max=832.45ms p(90)=225.29ms p(95)=226.52ms
      { expected_response:true }...: avg=139.61ms min=53.05ms med=215.08ms max=832.45ms p(90)=225.29ms p(95)=226.52ms
    http_req_failed................: 0.00%  0 out of 9214
    http_reqs......................: 9214   150.386495/s

    EXECUTION
    iteration_duration.............: avg=1.31s    min=1.27s   med=1.27s    max=4.23s    p(90)=1.28s    p(95)=1.28s   
    iterations.....................: 4607   75.193247/s
    vus............................: 27     min=27        max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 18 MB  288 kB/s
    data_sent......................: 765 kB 13 kB/s



running (1m01.3s), 000/100 VUs, 4607 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s